const slideshows = [
    {
        slideshowTitle: "3D модели",
        projects: [
            {
                title: {
                    text: "Кенче за сайдер",
                    color: "#242730"
                },
                explorer_name: "sider_can",
                types: ["Полигонално моделиране", "UV mapping"],
                category: "3D модели",
                used_software:["blender", "photoshop"],
                links: [
                    {
                        isProject: true,
                        project_explorer_name: "packages",
                        button_text: "За опаковката"
                    }
                ],
                sections: [
                    {
                        text: `За крайната визуализация на груповия проект по Графичен дизайн, трябваше да направя мокъп, с който да презентираме проекта - опаковките за сайдер. За целта моделирах кен, придържайки се към размерите на кен на Somersby 500 ml.`,
                    },
                    {
                        title: `UV mapping`,
                        text: "Следващата стъпка беше да направя UV mapping върху кенчето, за да мога да сложа готовите етикети като текстура на точното място.",
                        images: {
                            count: 1
                        }
                    },
                    {
                        text: `След рендиране на композициите, изображенията се изпращат към фотошоп за финална обработка и нюансиране на цветовете. `,
                        images: {
                            count: 1
                        }
                    }
                ]
            },
            {
                title: {
                    text: "Настолна лампа - пантограф",
                    color: "#242730"
                },
                explorer_name: "desk_lamp",
                types: ["Продукт дизайн", "CAD моделиране"],
                category: "3D модели",
                used_software:["fusion"],
                sections: [
                    {
                        text: `<span class="centered-text">Задачата беше да се проектира настолна лампа с механизъм - пантограф и след това да се моделира в CAD програма.</span>`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Рендирани изображения - детайли`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        text: `<span class="centered-text">Тук съм показала различни позиции на лампата.</span>`,
                        images: {
                            count: 2,
                            gap: "0 56px"
                        }
                    }
                ]
            },
            {
                title: {
                    text: "Битови контейнери ЕКО",
                    color: "#242730"
                },
                explorer_name: "trash_bins",
                types: ["Продукт дизайн", "CAD моделиране"],
                category: "3D модели",
                used_software:["sw"],
                sections: [
                    {
                        text: `Задачата беше да се проектират битови контейнери за разделно събиране на отпадъци, като идеята ми беше контейнерите да могат да бъдат пренареждани спрямо нуждите на потребителите и да е възможно с тях да се правят различни конфигурации.<br><span>Според направено проучване установих, че в ежедневието се изхвърлят различно количество  отпадъци, като най-много се изхвърлят отпадъци от пластмаса, след това хартия и накрая стъкло. Спрямо това определих размерите на контейнерите.</span><br><span>Захващането между контейнерите е вдъхновено от конструкторите. Исках да е възможно правенето на различни конфигурации помежду им, комбинирайки ги с други контейнери от същия тип.</span>`,
                    },
                    {
                        title: `Разработка на идеята`,
                        text: `Планирах, тъй като контейнерът за пластмаса трябва да бъде най-голям, той да е разположен под другите два, но за да е лесен за отваряне, трябваше да измисля вариант за отваряне с крак, а именно с използване на педал, който да отваря капаче, което се намира в горната част на контейнера.`,
                        images: {
                            count: 2,
                            openable: true,
                            gap: "0 62px"
                        }
                    },
                    {
                        text: `За захващане на контейнерите един към друг, в капаците направих изпъкнали цилиндърчета, които да се вкарват в основите на другите контейнери, което ще спомогне за това да се предотврати събарянето на кошчетата за боклук.</span><br><span>Предната страна на контейнерите направих да е наклонена, за да може да се захваща капакът на долният контейнер за горния. Изчислих, че 57 градусов ъгъл е достатъчен, за да може човек да си изхвърли отпадъка в контейнера, затова се спрях на толкова, за да може да не се губи от обема на горните контейнери.</span><br><span>Реших наклонът на контейнера за  пластмасата да го направя 65°, за да може хем да съответства по характер на останалите, хем да е удобен за натискане на педала.`,
                        images: {
                            count: 2,
                            openable: true,
                            gap: "0 24px"
                        }
                    },
                    {
                        title: `Цветови решения`,
                        text: `Реших да заложа на по-пастелните цветове, защото са по-приятни за окото и не привличат толкова вниманието, тъй като никой не желае кошчетата му за боклук да се превръщат в централен елемент в неговия интериор.`,
                        images: {
                            count: 1
                        }
                    },
                ]
            },
            {
                title: {
                    text: "Проект „Моята стая“",
                    color: "#242730"
                },
                explorer_name: "my_room",
                types: ["Интериорен проект", "Полигонално моделиране"],
                category: "3D модели",
                used_software:["3ds_max", "blender"],
                sections: [
                    {
                        text: `Целта на проекта беше да направя ново разпределение на моята стая. Помещението  се използва от 2 момичета в зряла  възраст. Стаята изпълнява функциите на спалня, работно помещение и място за почивка.`,
                    },
                    {
                        title: `План обзавеждане - чертежи`,
                        text: `На чертежа в ляво е показано сегашното разпределение на основните мебели в помещението,  осветителните тела, контакти и ключове за лампи.<br>Включила съм и оразмеряване на стаята. Височината на помещението е 250 см.<br><span>В дясно може да се види новият план за обзавеждане на стаята.</span>`,
                        images: {
                            count: 2,
                            openable: true,
                            gap: "0 82px",
                            languageVariants:true
                        }
                    },
                    {
                        title: `Разгъвки на стените`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        images: {
                            count: 4,
                            openable: true,
                            gap: "70px 105px"
                        }
                    },
                    {
                        title: `Стил на интериора`,
                        text: `Вдъхновение почерпих, както от Крайбрежния стил, така и от Биофилния дизайн. И двата стила използват цветове, вдъхновени от природата. Това включва сини, зелени, пясъчни и земни тонове, които създават спокойна и релаксираща атмосфера.<br><span>Растенията са важна част и от двата стила. Те не само добавят визуална красота, но и подобряват качеството на въздуха и създават усещане за свежест.</span><br><br><span>Стаята е с комбинация от светлосини, зелени, бели и дървесни тонове. Заложила съм повече на светлите цветове, тъй като те придават ефирност на пространството.</span>`,
                    },
                    {
                        title: `Моделиране на обектите`,
                        text: `Стаята и мебелите са моделирани в 3Ds Max, а след това са прехвърлени в Blender за текстуриране и рендиране.<br><span>Моделираните обекти са: Двуетажното легло с библиотеката; леглото на първия етаж; гардеробите за дрехи; изтеглящият прът за закачалки; бюрото и интериорното пространство.</span>`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Визуализации`,
                        images: {
                            count: 4,
                            languageVariants:true
                        }
                    },
                ]
            },
        ]
    },
    {
        slideshowTitle: "Графичен дизайн",
        projects: [
            {
                title: {
                    text: "Златна котна - плакат",
                    color: "#242730"
                },
                explorer_name: "golden_cat_poster",
                types: ["Дизайн на плакат", "Векторизиране на лого"],
                category: "Графичен дизайн",
                used_software:["illustrator", "photoshop"],
                sections: [
                    {
                        text: `Задачата беше да се разработи плакат за събитие, като се спрях на фестивала Магична среща  „Златна Котка“.<br><span>Фестивалът се провежда всяка година в Габрово, като състезателите се впускат в битка за различни награди, най-престижната от които е наградата „Златна Котка“, която  се връчва на човека с най-много точки от състезанието.</span>`,
                    },
                    {
                        title: `Векторизиране на логото`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Избор на цветове за логото`,
                        images: {
                            count: 1
                        }
                    }, 
                    {
                        title: `Концепция`,
                        text: `Като централен елемент, привличащ вниманието, исках да използвам типичен за събитието символ, а именно Златната котка. Реших да я превъпълтя в джин, вдъхновено от лампата на Аладин, но вместо лампа исках да е нещо по-типично  за илюзионистите и затова се насочих към карта Асо Каро. <br><span>Избрах да използвам Карото, тъй като често се асоциира с богатство и изобилие поради формата, която наподобява диамант. Докато Асото в повечето случаи се асоциира с най-силната карта в колодата.</span><br><br><span>Посланието исках да е загадъчно, за да стимулира хората да отидат на събитието - затова избрах котката джин да е под формата на въпросителен знак, който добавя елемент на мистериозност.</span>`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        text: `По-долу съм показала процеса на развитие на концепцията. Първоначалната ми идея беше картата да е Поп, а не Асо, тъй като исках да се обвърже с посланието „Царете на магията“.`,
                        images: {
                            count: 3,
                            gap: "0 110px",
                            openable: true
                        }
                    }
                ]
            },
            {
                title: {
                    text: "Bauhaus 93",
                    color: "#242730"
                },
                explorer_name: "bauhaus",
                types: ["Кирилизация на шрифт"],
                category: "Графичен дизайн",
                used_software:["illustrator"],
                sections: [
                    {
                        text: `Задачата беше да си изберем шрифт, който няма кирилизация и да  кирилизираме само главните му букви. Аз се спрях на шрифта BAUHAUS 93, тъй като няма българска кирилизация, а ми харесва колко ретро изглежда.<br><br><span>Bauhaus 93 е декоративен шрифт с прости геометрични форми и равни щрихи, които придават на шрифта чист и отличителен вид.</span>`,
                    },
                    {
                        title: `Главни букви на латиница`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Главни букви на кирилица`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        text: `Отдолу съм показала презентационните материали, които използвах за представяне на шрифта. Заложих на пастелните цветове без преливки и прости форми, за да запазя това ретро усещане, което шрифта носи в себе си.`,
                        images: {
                            count: 2,
                            gap: "0 73px"
                        }
                    }
                ]
            },
            {
                title: {
                    text: "Gato Boracho",
                    color: "#242730"
                },
                explorer_name: "gato_boracho",
                types: ["Лого дизайн", "Групов проект"],
                category: "Графичен дизайн",
                used_software:["illustrator"],
                links: [
                    {
                        isProject: true,
                        project_explorer_name: "packages",
                        button_text: "За опаковката"
                    }
                ],
                sections: [
                    {
                        text: `Задачата беше да се разработи търговска марка за сайдер. Целевата аудитория са младите хора и семейства, които обичат да пият леки студени напитки през горещото време и да се радват на моментите от живота. <br><br><span>Търсена беше екзотична концепция, която да напомня за почивките през лятото в някоя гореща страна като Испания, затова се спряхме на испанско заглавие.</span><br><br><span>Искахме в етикета да включим рекламен персонаж - котка, тъй като рекламните фигури привличат вниманието и дават по-забавен и приятен вид на марката. Тъй като разработваме търговска марка за сайдер решихме да разиграем персонажа на пияна котка в различни ситуации спрямо вкусовете на продукта. В превод Gato Borracho означава “пияна котка”.</span>`,
                    },
                    {
                        title: `Изработка на логотип`,
                        text: `За крайното решение е използван шрифтът Geson Bamer с изменения в буквите “G” и “h”.<br><span>Реших да използвам този шрифт, защото е игрив и серифите на буквите наподобяват котешки опашки. За по-голямо засилване на ефекта на рекламния персонаж, реших да акцентирам върху “котешкото” като добавя главички на котка в двете думи на търговската марка, като ги разположих по такъв начин, за да се балансира създадената ”тежест” в шрифта.</span>`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        text: `По-долу съм показала 2 варианта от избора на шрифт за логото Gato Boracho. В дясно може да се види как е изглеждала буквата “G” преди промените върху шрифта Geson Bamer.  `,
                        images: {
                            count: 2
                        }
                    }
                ]
            },
            {
                title: {
                    text: "Опаковки за сайдер",
                    color: "#242730"
                },
                explorer_name: "packages",
                types: ["Дизайн на опаковки", "Групов проект"],
                category: "Графичен дизайн",
                used_software:["illustrator", "photoshop"],
                links: [
                    {
                        isProject: true,
                        project_explorer_name: "gato_boracho",
                        button_text: "За логото"
                    },
                    {
                        isProject: true,
                        project_explorer_name: "sider_can",
                        button_text: "За 3Д модела"
                    }
                ],
                sections: [
                    {
                        text: `Задачата беше да се разработи опаковка за сайдер. Целевата аудитория са младите хора и семейства, които обичат да пият леки студени напитки през горещото време и да се радват на моментите от живота.<br><br><span>Искахме в етикета да включим рекламен персонаж - котка, тъй като рекламните фигури привличат вниманието и дават по-забавен и приятен вид на марката. Решихме рекламният персонаж да разиграем в различни сцени спрямо вкусът на сайдера.</span>`,
                        images: {
                            count: 1,
                            width: "100%"
                        }
                    },
                    {
                        title: `Пазарно проучване`,
                        text: `Според направено проучване и запитване към потребителите беше установено, че алуминиевите кенове са по-предпочитани от стъклените бутилки.<br><span>Това се основава на факта, че кеновете са по-удобни за пренасяне и охлаждане от стъклените бутилки, които много често са по-тежки и по-крехки от металните кенчета. Освен това металните кенове предпазват сайдера от светлина и запазват свежестта му.</span>`,
                        images: {
                            count: 1,
                            languageVariants:true
                        }
                    },
                    {
                        title: `Етапи на развитие на етикетите`,
                        images: {
                            count: 4,
                            gap: "35px 83px"
                        }
                    },
                    {
                        title: `Крайно решение`,
                        text: `По-долу съм показала как изглеждат разгъвките на етикетите - ябълка, портокал, нар, грозде и круша. Размерите на разгъвките са изчислени според кен  на Somersby - 500 ml.`,
                        images: {
                            count: 5,
                            gap: "35px 35px",
                            openable: true
                        } 
                    }
                ]
            },
            {
                title: {
                    text: "Пъзел Пийс",
                    color: "#242730"
                },
                explorer_name: "puzzle_piece",
                types: ["Лого дизайн"],
                category: "Графичен дизайн",
                used_software:["illustrator"],
                links: [
                    {
                        isProject: false,
                        path: "./brand_book_bg.pdf",
                        button_text: "Бранд бук"
                    }
                ],
                sections: [
                    {
                        text: `Целта на задачата беше да се разработи търговска марка за компания, както на кирилица, така и на латиница. Аз реших да направя логотип на въображаема фирма за пъзели с името “Пъзел Пийс”, като исках логото да съдържа комбинация от словни и фигуративни елементи.<br><span>За повече подробности можете да посетите БРАНД БУК-а, който направих за фирмата. Тук ще покажа накратко процеса, през който преминах до достигане на крайното решение.</span>`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Избор на фигуративна марка`,
                        text: `За окончателен вариант на фигуративната марка избрах най-левият логотип, защото запазва четимостта си, дори когато е много малък.`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Комбинации за логотип - търсене на решение`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Крайно решение - кирилица и латиница`,
                        images: {
                            count: 2,
                            gap: "0 105px"
                        }
                    }
                ]
            }   
        ]
    },
    {
        slideshowTitle: "Илюстрации",
        projects: [
            {
                title: {
                    text: "В света на Хераските",
                    color: "#242730"
                },
                explorer_name: "herasks",
                types: ["Дизайн на герои"],
                category: "Илюстрации",
                used_software:["photoshop"],
                finalImageLanguageVariants: true,
                sections: [
                    {
                        text: `Проектирах воден представител, на базата на задълбочено проучване за биолуминесцентните живи организми в дълбините на океана.<br><span>Героят, който създадох обитава зоната на Полумрака. Той използва биолуминесценцията за хищнически цели и за общуване. Светещият герой има способността на Драконовата риба, да вижда червеният цвят, като същевременно излъчва синя светлина, за да привлича своята плячка.</span><br><span>Героят кръстих “Хераск”. Името му произлиза от гръцката богиня Хера, която е  покровителка на брака и семейството. Насочих се към това име, тъй като вида, който създадох е един от малкото, ако не и единственият на тази дълбочина в океана, който е загрижен за съхранението на своето семейство.</span>`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        title: `Мъжкият`,
                        text: `Мъжкият е бърз плувец, затова на опашката си има биолуминесцентна „въдица“, чрез която да привлича други водни представители. Когато създанието е достатъчно близо, мъжкият прибира светещото си пипало в опашката, като оставя плячката си в пълен мрак, неподозираща, че този хищник има способността да излъчва червена светлина чрез фотофорите, намиращи се около очите му.`,
                    },
                    {
                        title: `Женската`,
                        text: `Върху екзоскелета на женската са разположени фотофори, които излъчват синя светлина ако женската се почувства застрашена от друг хищник. Другите два светещи елемента са пригодени да излъчват червена светлина, за да може малкото да се ориентира къде се намира майка му.`,
                        images: {
                            count: 2,
                            gap: "0 85px",
                            openable: true,
                            languageVariants: true
                        }
                    }
                ]
            },
            {
                title: {
                    text: "Дяволчето „Горещи ръце“",
                    color: "#242730"
                },
                explorer_name: "devil",
                types: ["Дизайн на герои"],
                category: "Илюстрации",
                used_software:["photoshop"],
                sections: [
                    {
                        text: `<span class="centered-text">Работата е вдъхновена от рисунка на Крис Рийняк.</span>`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        text: `Първата рисунка на този герой направих през 2018 г. След 5 години реших да създам герой придържайки се към неговата илюстрация. Това ми беше първият опит в дизайна на герои.<br><br><span>Последният рендер е мястото, където това дяволче живее.</span>`,
                        images: {
                            count: 1
                        }
                    }
                ]
            },
            {
                title: {
                    text: "Златна котка - тениска",
                    color: "#242730"
                },
                explorer_name: "golden_cat_T-shirt",
                types: ["Дизайн на тениска", "2024 г."],
                category: "Илюстрации",
                used_software:["photoshop"],
                sections: [
                    {
                        text: `Целта на проекта беше да се разработи дизайн на тениска за участниците на фестивала Магична среща ЗЛАТНА КОТКА. Дизайнът трябваше да е подходящ за носене, както от мъже, така и от жени, затова се спрях на сива тениска, поради възможността за носене и от двата пола.`,
                        images: {
                            count: 1
                        }
                    },
                    {
                        text: `Показала съм по-долу как се е развила идеята за тениската.<br><br>Символът на събитието е тази златна котка и също наградата, която участникът завършил на първо място получава. Затова исках да я включа в дизайна на тениската, като централен елемент, който си взаимодейства с предмети, които се използват за правене на трикове в илюзията.</span>`,
                        images: {
                            count: 2,
                            gap: "0 81px"
                        }
                    }
                ]
            }
        ]
    }
];